---
kind: type
id: T:Autodesk.Revit.DB.Macros.DocumentEntryPoint
source: html/99996ba9-d1a7-d27e-c0ce-eb271a4c35bb.htm
---
# Autodesk.Revit.DB.Macros.DocumentEntryPoint

For Revit Macros use only.

## Syntax (C#)
```csharp
public abstract class DocumentEntryPoint : Document,
	IEntryPoint
```